<?php

namespace Database\Seeders;

use App\Models\RoadMap;
use Illuminate\Database\Seeder;

class RoadMapSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $roadmaps = [
            [
                'title' => 'مسار تطوير المواقع',
                'description' => 'هذا المسار يقدم لك كل ما تحتاجه لتصبح مطور مواقع محترف. ستتعلم أساسيات تصميم وتطوير مواقع الإنترنت باستخدام HTML، CSS، و JavaScript، بالإضافة إلى تعلم كيفية بناء مواقع ديناميكية باستخدام لغات مثل PHP أو Python وربطها بقاعدة بيانات مثل MySQL أو PostgreSQL.',
            ],
            [
                'title' => 'مسار علم البيانات',
                'description' => 'علم البيانات هو مجال يركز على تحليل وفهم البيانات الضخمة. في هذا المسار، ستتعلم كيفية جمع البيانات، تحليلها، وتقديم رؤى قيمة باستخدام أدوات مثل Python وR، بالإضافة إلى استخدام مكتبات تحليل البيانات مثل Pandas وNumPy، مع استكشاف طرق التنبؤ والنمذجة.',
            ],
            [
                'title' => 'مسار الذكاء الاصطناعي',
                'description' => 'الذكاء الاصطناعي هو المستقبل. في هذا المسار، ستتعلم كيفية بناء وتدريب أنظمة ذكية قادرة على التفكير واتخاذ القرارات. سيتم تغطية موضوعات مثل الشبكات العصبية، التعلم العميق، ومعالجة اللغات الطبيعية، باستخدام أدوات مثل TensorFlow وKeras.',
            ],
            [
                'title' => 'مسار تعلم الآلة',
                'description' => 'تعلم الآلة هو فرع من فروع الذكاء الاصطناعي يركز على تطوير خوارزميات قادرة على التعلم من البيانات. ستتعلم في هذا المسار كيفية بناء نماذج قادرة على التعلم والتكيف مع البيانات المتغيرة باستخدام مكتبات مثل Scikit-learn وTensorFlow.',
            ],
            [
                'title' => 'مسار الأمن السيبراني',
                'description' => 'في عصر الإنترنت المتطور، أصبح الأمان الرقمي أكثر أهمية من أي وقت مضى. هذا المسار يعلمك كيفية حماية الأنظمة والشبكات من الهجمات السيبرانية من خلال تعلم تقنيات الاختبار الأمني، التشفير، وأفضل ممارسات الحماية. ستكتسب أيضاً مهارات في تحديد وتحليل الثغرات الأمنية.',
            ],
            [
                'title' => 'مسار تطوير البرمجيات',
                'description' => 'تطوير البرمجيات هو عملية إنشاء برامج تلبي احتياجات المستخدمين. في هذا المسار، ستتعلم مبادئ هندسة البرمجيات، التصميم البرمجي، وإدارة المشاريع. كما ستتعرف على لغات البرمجة الشائعة مثل Java، C#، وPython، وكيفية استخدام أدوات مثل Git لإدارة إصدار البرمجيات.',
            ],
        ];

        foreach($roadmaps as $roadmap) {
            RoadMap::create($roadmap);
        }
    }
}
